src/cf/DataProcessors/СоздаёмНоменклГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СоздаёмНоменклГруппы</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписАк</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/НоменклатурныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НоменклатурныеГруппы</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/СоздаёмНоменклГруппы/Ext/ObjectModule.bsl
Процедура СоздатьГруппу (Наименование,Размер) Экспорт
	Если Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(СокрЛП(Наименование),Истина) = Справочники.НоменклатурныеГруппы.ПустаяСсылка() Тогда
		НачатьТранзакцию();
		НомГрупп = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		НомГрупп.Наименование = СокрЛП(Наименование);
		НомГрупп.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
		Попытка
			НомГрупп.Записать();
		Исключение
			Сообщить (ОписаниеОшибки());
			ОтменитьТранзакцию();
			возврат;
		КонецПопытки;
		Ед = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		Ед.Владелец = НомГрупп.Ссылка;
		Ед.ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
		Ед.Коэффициент = 1;
		Ед.Наименование = "шт";
		Попытка
			Ед.Записать();
		Исключение
			Сообщить (ОписаниеОшибки());
			ОтменитьТранзакцию();
			возврат;
		КонецПопытки;
		НомГрупп.ЕдиницаХраненияОстатков = Ед.Ссылка;
		Попытка
			НомГрупп.Записать();
		Исключение
			Сообщить (ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;
		
		Свво = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Свво.Объект = НомГрупп.Ссылка;
		Свво.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Размер",Истина);
		Свво.Значение = СокрЛП(Размер);
		Попытка
			Свво.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			Сообщить (ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;
	Иначе
		Ответ = Вопрос ("Эта группа ужЕ существует. Обновить её?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТекГрупп = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(СокрЛП(Наименование),Истина).ПолучитьОбъект();
			ТекГрупп.Наименование = Наименование;
			Отбор = Новый Структура("Объект");
			Отбор.Объект = ТекГрупп.Ссылка; 
			ВыбРег = РегистрыСведений.ЗначенияСвойствОбъектов.Выбрать(Отбор);
			Пока ВыбРег.Следующий() Цикл
				Если СокрЛП(ВыбРег.Свойство.Наименование) = СокрЛП("Размер")	Тогда
					Запись = ВыбРег.ПолучитьМенеджерЗаписи();
					Запись.Значение = Размер;
					Запись.Записать();
				КонецЕсли;
			КонецЦикла;
			ТекГрупп.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура Распределить (Наименование, Описалово) Экспорт
	
	Для каждого стр из СписАк Цикл
		Об = стр.Номенклатура.ПолучитьОбъект();
		Об.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(СокрЛП(Наименование),Истина);
		Об.ДополнительноеОписаниеНоменклатуры = Описалово;
		Попытка
			Об.Записать();
		Исключение
			Сообщить (ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
		

КонецПроцедуры
